app/controllers/neighborhoods_controller.rb

def index
  @neighborhoods = Neighborhood.all
---
SELECT "neighborhoods".* FROM "neighborhoods"

def show
  @neighborhood = Neighborhood.find(params[:id])
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]