app/controllers/raccoons_controller.rb

  def index
    @raccoons = Raccoon.all
---
SELECT "raccoons".* FROM "raccoons"

  def show
    @raccoon = Raccoon.find(params[:id])
---
SELECT  "raccoons".* FROM "raccoons" WHERE "raccoons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]